Revit 2027 API
RebarPropagation Class
 An utility class containing functions that can be used to propagate rebar elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarPropagation
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RebarPropagation
Public NotInheritable Class RebarPropagation
public ref class RebarPropagation abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarPropagation = class end
The RebarPropagation type exposes the following members.
Methods
Name | Description
AlignByFace |  It will copy the source rebars, will align them to the destination face based on the source face and adapt them to destination host.
AlignByHost |  It will copy the source rebars, will align them in the same way as how the source host is aligned to destination host and will adapt them to the destinaion host.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace